export const NAV_MENU = [
  { icon: 'dashboard', title: 'Дашборд' },
  { icon: 'calendar', title: 'Календарь' },
  { icon: 'book', title: 'Обучение' },
  { icon: 'tasks', title: 'Задачи' },
  { icon: 'ipr', title: 'ИПР' },
];

export const EMPLOYERS_DATA = [
  'Агата Колесникова',
  'Айдар Гораев',
  'Александр Смирнов',
  'Иванов Иван',
  'Ирина Мирошниченко',
  'Мария Агалакова',
  'Эрнест Хемингуэй',
];

export const GRAIDE_DATA = [
  'Junior',
  'Middle',
  'Senior',
];

export const SPECIALITY_DATA = [
  'Бизнес Аналитик',
  'Дизайнер',
  'Менеджер продукта',
  'Менеджер проекта',
  'Разработчик/программист',
  'Системный аналитик',
  'Тестировщик',
];

export const METRIC_DATA = [
  'Сотрудники',
  'Выполнение ИПР',
  'Оценка навыков',
  'Вовлеченность',
];

export const MATRIX_DATA = {
  mentor: 'Назначить в роли менторов',
  iniciative: 'Участвовать в инициативах',
  careare: 'Достигать карьерные цели',
  task: 'Правильно распределять задачи',
  education: 'Создавать возможности для обучения и развития',
  project: 'Вовлекать в стратегические проекты',
  editTask: 'Изменить роли/задачи',
  learning: 'Разработать программу поддержки и обучения',
  engagement: 'Повышение вовлеченности',
};
